app/views/user_event_awards/_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
    <%= form.label :user_id, style: "display: block" %>
    <%= form.collection_select :user_id, User.order(:name), :id, :name, prompt: "Selecione Usuario" %>

SELECT "events".* FROM "events" ORDER BY "events"."description" ASC
---
    <%= form.label :event_id, style: "display: block" %>
    <%= form.collection_select :event_id, Event.order(:description), :id, :description, prompt: "Selecione Evento" %>

SELECT "events".* FROM "events" ORDER BY "events"."description" ASC
---
    <%= form.label :award_id, style: "display: block" %>
    <%= form.collection_select :award_id, Event.order(:description), :id, :description, prompt: "Selecione Premio" %>