ex_02_modelagem_dados/app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Evento01"], ["created_at", "2023-03-28 21:37:55.428552"], ["updated_at", "2023-03-28 21:37:55.428552"]]