app/controllers/awards_controller.rb

SELECT "awards".* FROM "awards"
---
  def index
    @awards = Award.all

INSERT INTO "awards" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "premio01"], ["created_at", "2023-03-28 21:38:39.441166"], ["updated_at", "2023-03-28 21:38:39.441166"]]
---
  def create
    @award = Award.new(award_params)

    respond_to do |format|
      if @award.save

SELECT "awards".* FROM "awards" WHERE "awards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_award
      @award = Award.find(params[:id])