app/controllers/user_event_awards_controller.rb

SELECT "user_event_awards".* FROM "user_event_awards"
---
  def index
    @user_event_awards = UserEventAward.all

INSERT INTO "user_event_awards" ("description", "user_id", "event_id", "award_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["description", nil], ["user_id", 2], ["event_id", 1], ["award_id", 3], ["created_at", "2023-03-28 22:00:46.463882"], ["updated_at", "2023-03-28 22:00:46.463882"]]
---
  def create
    @user_event_award = UserEventAward.new(user_event_award_params)

    respond_to do |format|
      if @user_event_award.save

SELECT "awards".* FROM "awards" WHERE "awards"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "user_event_awards".* FROM "user_event_awards" WHERE "user_event_awards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_user_event_award
      @user_event_award = UserEventAward.find(params[:id])